#include "MCU_Detect.h"

//========================================================================
// STC15W4K58S 4个按键：P2^3,P2^4,P2^5,P2^6
// 对应Signal_flag值为：
//                      P2^3 : 0x01
//                      P2^4 : 0x02
//                      P2^5 : 0x03
//                      P2^6 : 0x04
//========================================================================

//========================================================================
// 函数: unsigned chcar Detect_Key(void)
// 描述: 按键扫描函数
// 参数: time:延时时间
// 返回: 无
// 说明：单片机频率不同，延时效果不同
// 版本: V1.0, 2020.03.09
//========================================================================
/*
unsigned char Detect_Key(void)
{
	unsigned char flag=0x00;
	if(P23==0){Delay_ms(10);if(P23==0){flag=0x01;}}
	if(P24==0){Delay_ms(10);if(P24==0){flag=0x01;}}
	if(P25==0){Delay_ms(10);if(P25==0){flag=0x01;}}
	if(P26==0){Delay_ms(10);if(P26==0){flag=0x01;}}
	return flag;
}
*/